import Foundation

struct Quote {
    let text: String
    let autor: String?
}

var arrayOfQuotes: [Quote] = [
    Quote(text: "Если вы решили действовать, закройте двери для сомнений.", autor: "Фридрих Вильгельм Ницше"), Quote(text: "Ты можешь сказать, что у тебя плохая генетика, плохой обмен веществ, а можешь просто поднять свою задницу с дивана и начать работать над собой, задаться целью и верить в себя. В этом случае ты обязательно добьёшься успеха.", autor: "Арнольд Шварценегер"), Quote(text: "Чтобы быть успешным, нужно чтобы была страсть к тому, что вы делаете.", autor: "Стив Джобс"), Quote(text: "Сильное желание чему-то научиться – это уже 50% успеха.", autor: "Дейл Карнеги")
]

var arrayOfFavotites: [Quote] = []

